In [1]:
import pandas as pd 
import numpy as np
import sqlite3
conn = sqlite3.connect('CourseData2.db')
c = conn.cursor()

In [2]:
%load_ext sql

In [3]:
%%sql
sqlite:///CourseData2.db

'Connected: @CourseData2.db'

In [4]:
%%sql
--Dropping tables for when we need to restart and clear CourseData database-- 
--Drop ERD tables--
DROP TABLE IF EXISTS SECTION;
DROP TABLE IF EXISTS CATALOG;
DROP TABLE IF EXISTS INSTRUCTOR;
DROP TABLE IF EXISTS COURSE_MEETING;

--Drop import tables--
DROP TABLE IF EXISTS import_course;
DROP TABLE IF EXISTS import_course_meeting;
DROP TABLE IF EXISTS import_course_catalog;

 * sqlite:///CourseData2.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [5]:
%%sql
--Creating import_catalog table-- 

CREATE TABLE 'import_course_catalog' (
    program_code TEXT NOT NULL,
    program_name VARCHAR NOT NULL,
    catalog_id VARCHAR NOT NULL,
    course_title VARCHAR NOT NULL, 
    credits VARCHAR NOT NULL,
    prereqs VARCHAR, 
    coreqs VARCHAR,
    fees VARCHAR,
    attributes VARCHAR,
    description VARCHAR 
);

 * sqlite:///CourseData2.db
Done.

[]

In [6]:
%%sql
--Creating import_course_meeting table-- 

CREATE TABLE 'import_course_meeting' (
    term VARCHAR NOT NULL,
    crn INTEGER NOT NULL,
    location VARCHAR NOT NULL,
    day TEXT NOT NULL,
    start VARCHAR NOT NULL,
    end VARCHAR NOT NULL 
);

 * sqlite:///CourseData2.db
Done.

[]

In [7]:
%%sql
--Creating import_course table-- 

CREATE TABLE 'import_course' (
    term VARCHAR NOT NULL,
    crn INTEGER NOT NULL,
    catalog_id VARCHAR NOT NULL,
    section VARCHAR NOT NULL,
    credits VARCHAR,
    title VARCHAR, 
    meetings VARCHAR,
    timecodes VARCHAR, 
    primary_instructor TEXT,
    cap INTEGER, 
    act INTEGER, 
    rem INTEGER 
);

 * sqlite:///CourseData2.db
Done.

[]

In [8]:
%%sql
-- Creating table INSTRUCTOR with surrogate primary key-- 

CREATE TABLE 'INSTRUCTOR' (
    InID INTEGER NOT NULL PRIMARY KEY,
    Name TEXT NOT NULL
);

--Creating table CATALOG with CatID as the primary key-- 

CREATE TABLE 'CATALOG'(
    CatID VARCHAR PRIMARY KEY,
    Title VARCHAR NOT NULL,
    Description TEXT NOT NULL,
    Credits TEXT NOT NULL,
    PName TEXT NOT NULL,
    PCode TEXT,
    PREREQS TEXT,
    COREQS TEXT,
    FEES INTEGER,
    Attribute TEXT
    
);

--Creating table SECTION with surrogate primary key-- 

CREATE TABLE 'SECTION'(
    SID INTEGER NOT NULL PRIMARY KEY,
    CRN INTEGER NOT NULL,
    Term TEXT NOT NULL,
    Section VARCHAR NOT NULL,
    Cap INTEGER,
    Act INTEGER,
    Rem INTEGER,
    CatID VARCHAR,
    InID INTEGER,
    FOREIGN KEY (CatID) REFERENCES COURSE(CatID),
    FOREIGN KEY (InID) REFERENCES INSTRUCTOR(InID)
);

--Creating table COURSE_MEETING with CatID as the Primary Key-- 

CREATE TABLE 'COURSE_MEETING' (
    MID INTEGER NOT NULL PRIMARY KEY,
    CRN INTEGER NOT NULL,
    Term TEXT NOT NULL,
    Start TEXT NOT NULL,
    Location VARCHAR NOT NULL,
    Day TEXT NOT NULL,
    End TEXT NOT NULL,
    FOREIGN KEY (CRN) REFERENCES SECTION(CRN),
    FOREIGN KEY (Term) REFERENCES SECTION(Term)
);

 * sqlite:///CourseData2.db
Done.
Done.
Done.
Done.

[]

**Creating dataframes for the import course**

In [9]:
## populating import_course table
fall = ['SourceData/Fall2014/courses.csv','SourceData/Fall2015/courses.csv', 'SourceData/Fall2016/courses.csv',
        'SourceData/Fall2017/courses.csv','SourceData/Fall2018/courses.csv']
dff0 = pd.read_csv(fall[0])
dff1 = pd.read_csv(fall[1])
dff2 = pd.read_csv(fall[2])    
dff3 = pd.read_csv(fall[3])
dff4 = pd.read_csv(fall[4])

In [10]:
df_fall = pd.concat([dff0, dff1, dff2, dff3, dff4], axis=0)
df_fall.sample(5)

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
795,Fall2016,77343,LA 0210,01,3.000,Readings in Latin Prose and Poetry I,"[{'days': 'MR', 'times': '1230pm-0145pm', 'dat...",['MR 1230pm-0145pm 09/06-12/12 CNS 306'],Vincent J. Rosivach,30,22,8
143,Fall2014,71624,BI 0170P,I,0.000,General Biology I PLG,"[{'days': 'R', 'times': '0300pm-0350pm', 'date...",['R 0300pm-0350pm 09/02-12/08 BNW 319'],TBA,12,8,4
996,Fall2018,74534,ME 0350L,01,1.000,Energy Transfer Lab,"[{'days': 'T', 'times': '1230pm-0230pm', 'date...",['T 1230pm-0230pm 09/04-12/10 BNW 128'],Bahareh Estejab,15,16,-1
472,Fall2016,78965,EN 0011,49,3.000,Texts and Contexts I: Writing as Craft and Inq...,"[{'days': 'TF', 'times': '0330pm-0445pm', 'dat...",['TF 0330pm-0445pm 09/06-12/12 DMH 131'],Michael Anthony DeStefano,19,19,0
927,Fall2015,75038,MA 0351,A,3.000,Probability Theory,"[{'days': 'MR', 'times': '0930am-1020am', 'dat...","['MR 0930am-1020am 09/01-12/07 BNW 340', 'W 09...",Benjamin Fine,20,24,-4

In [11]:
df_fall.describe()

                crn         cap          act          rem
count   7486.000000  7486.00000  7486.000000  7486.000000
mean   74523.769169    18.39487    16.310446     2.219076
std     2512.545835    14.41373     9.863494    17.175757
min    70001.000000     0.00000    -1.000000   -75.000000
25%    72213.000000    12.00000     8.000000     0.000000
50%    74848.500000    19.00000    16.000000     1.000000
75%    76698.750000    25.00000    24.000000     5.000000
max    79215.000000   500.00000    90.000000   999.000000

In [12]:
spring = ['SourceData/Spring2015/courses.csv','SourceData/Spring2016/courses.csv', 'SourceData/Spring2017/courses.csv',
        'SourceData/Spring2018/courses.csv','SourceData/Spring2019/courses.csv', 'SourceData/SpringBreak2017/courses.csv']
dfs0 = pd.read_csv(spring[0])
dfs1 = pd.read_csv(spring[1])
dfs2 = pd.read_csv(spring[2])    
dfs3 = pd.read_csv(spring[3])
dfs4 = pd.read_csv(spring[4])
dfs5 = pd.read_csv(spring[5])

In [13]:
df_spring = pd.concat([dfs0,dfs1,dfs2,dfs3,dfs4,dfs5], axis=0)
df_spring.sample(5)

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
113,Spring2016,37455,BI 0108L,A,0.000,Human Anatomy & Physiology Lab,"[{'days': 'M', 'times': '0100pm-0350pm', 'date...",['M 0100pm-0350pm 01/19-05/03 BNW 240'],Christine Earls,20,17,3
23,Spring2017,31428,AC 0265,01,3.000,Accounting Information Systems,"[{'days': 'W', 'times': '0800am-1030am', 'date...",['W 0800am-1030am 01/17-05/02 DSB 107'],Scott M Brenner,20,22,-2
1117,Spring2015,31880,PS 0016,B,3.000,General Physics II,"[{'days': 'MR', 'times': '0930am-1040am', 'dat...","['MR 0930am-1040am 01/20-04/30 BNW 333', 'W 09...",David Roberts Winn,22,18,4
1254,Spring2019,38825,PY 0361,01,3.000,Senior Seminar: Current Issues in Behavioral N...,"[{'days': 'W', 'times': '1100am-0130pm', 'date...",['W 1100am-0130pm 01/22-04/30 BNW 469'],Shannon M. Harding,15,15,0
1242,Spring2018,34549,RS 0101D,03,3.000,Exploring Religion: Religion in a Comparative Key,"[{'days': 'MWR', 'times': '0200pm-0250pm', 'da...",['MWR 0200pm-0250pm 01/16-05/01 CNS 202'],John E. Thiel,25,22,3

In [14]:
df_spring.describe()

                crn          cap          act          rem
count   7122.000000  7122.000000  7122.000000  7122.000000
mean   35212.001966    18.123982    15.658804     2.465178
std     2618.670948    10.876640    10.342885     6.497100
min    31001.000000     0.000000     0.000000   -47.000000
25%    32773.250000    11.000000     7.000000     0.000000
50%    34835.000000    19.000000    16.000000     1.000000
75%    37693.750000    25.000000    24.000000     4.000000
max    41702.000000   100.000000    90.000000    89.000000

In [15]:
summer = ['SourceData/Summer2015/courses.csv', 'SourceData/Summer2016/courses.csv',
        'SourceData/Summer2017/courses.csv','SourceData/Summer2018/courses.csv']
dfsm0 = pd.read_csv(summer[0])
dfsm1 = pd.read_csv(summer[1])
dfsm2 = pd.read_csv(summer[2])    
dfsm3 = pd.read_csv(summer[3])

In [16]:
df_summer = pd.concat([dfsm0,dfsm1,dfsm2,dfsm3], axis=0)
df_summer.sample(5)

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
16,Summer2015,55160,AE 0295,01,3.000,Ethics in Law and Society,[],[],Lisa M. Sticca-Conrod,20,11,9
6,Summer2016,56179,AC 0530,01,3.000,"Accounting for Governments, Hospitals, and Uni...","[{'days': 'TF', 'times': '0900am-1215pm', 'dat...","['TF 0900am-1215pm 05/24-06/28 DSB 111', 'W 09...",Milo W. Peck,18,25,-7
7,Summer2016,56180,AC 0530,02,3.000,"Accounting for Governments, Hospitals, and Uni...","[{'days': 'TF', 'times': '0145pm-0500pm', 'dat...","['TF 0145pm-0500pm 05/24-06/28 DSB 111', 'W 09...",Milo W. Peck,18,24,-6
32,Summer2015,55164,BI 0107,A,4.000,Human Anatomy & Physiology I,"[{'days': 'MWF', 'times': '0800am-1100am', 'da...",['MWF 0800am-1100am 06/01-07/01 MCA 102'],Anthony J. DeCristofaro,16,16,0
46,Summer2018,58344,CH 0111,01,3.000,General Chemistry I,"[{'days': 'MTWRF', 'times': '0800am-1000am', '...",['MTWRF 0800am-1000am 06/04-07/06 BNW 334'],Sangamithra Chintapalli,16,9,7

In [17]:
df_summer.describe()

                crn          cap          act          rem
count   1224.000000  1224.000000  1224.000000  1224.000000
mean   56704.305556    14.843954    10.913399     3.928922
std     1143.898206    10.771969     9.124774     6.881239
min    55001.000000     0.000000    -1.000000   -24.000000
25%    55382.750000     6.000000     5.000000     0.000000
50%    56517.500000    16.000000     9.000000     3.000000
75%    58008.500000    20.000000    15.000000     9.000000
max    58477.000000    60.000000    59.000000    24.000000

In [18]:
winter = ['SourceData/Winter2015/courses.csv', 'SourceData/Winter2016/courses.csv',
        'SourceData/Winter2017/courses.csv','SourceData/Winter2018/courses.csv']
dfw0 = pd.read_csv(winter[0])
dfw1 = pd.read_csv(winter[1])
dfw2 = pd.read_csv(winter[2])    
dfw3 = pd.read_csv(winter[3])

In [19]:
df_winter = pd.concat([dfw0,dfw1,dfw2,dfw3], axis=0)
df_winter.sample(5)

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
22,Winter2016,11609,PO 0133,OL1,3.000,United States Foreign Policy,[],[],Lucrecia Garcia Iommi,25,20,5
0,Winter2017,11705,AH 0172,OL1,3.000,History of Photography,[],[],Lauren Elise Cesiro,20,18,2
1,Winter2016,11603,AE 0291,OL1,3.000,Business Ethics,[],[],Lisa M. Sticca-Conrod,25,17,8
8,Winter2016,11606,EC 0011,OL1,3.000,Introduction to Microeconomics,[],[],William F. Vasquez Mazariegos,25,12,13
19,Winter2017,11719,SO 0279,01,3.000,Criminal Justice System Seminar,"[{'days': 'MTWRF', 'times': '0830am-0430pm', '...",['MTWRF 0830am-0430pm 01/04-01/10 DMH 231'],Rose P. Rodrigues,15,13,2

In [20]:
df_winter.describe()

                crn         cap         act         rem
count    105.000000  105.000000  105.000000  105.000000
mean   11524.266667   17.133333   12.342857    4.790476
std      355.382575    7.612069    6.584990    6.207463
min    10893.000000    0.000000    0.000000   -3.000000
25%    11603.000000   15.000000    9.000000    0.000000
50%    11633.000000   20.000000   12.000000    4.000000
75%    11802.000000   20.000000   18.000000    9.000000
max    11841.000000   30.000000   25.000000   27.000000

In [21]:
df_course = pd.concat([df_fall, df_spring, df_summer, df_winter], axis=0)
df_course.sample(5)

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
299,Spring2018,34996,CS 0331,01,3.000,Operating Systems,"[{'days': 'W', 'times': '0630pm-0900pm', 'date...",['W 0630pm-0900pm 01/16-05/01 BNW 166'],Joseph Corcoran,20,9,11
1076,Fall2017,71499,NS 0323C,02,0.000,Pediatric Nursing Clinical,"[{'days': 'SU', 'times': '0700am-0530pm', 'dat...",['SU 0700am-0530pm 10/16-12/11 CMC '],Natesha Aumuo Bestman,6,6,0
460,Fall2015,75774,EN 0011,UU,3.000,Texts and Contexts I: Writing as Craft and Inq...,"[{'days': 'MR', 'times': '0930am-1045am', 'dat...",['MR 0930am-1045am 09/01-12/07 CNS 10'],Rebecca Louise Dimyan,19,19,0
67,Spring2016,37027,AE 0284,A,3.000,Environmental Ethics,"[{'days': 'R', 'times': '0630pm-0900pm', 'date...",['R 0630pm-0900pm 01/19-05/03 DSB 110B'],David R. Brown,30,23,7
781,Fall2015,75258,MG 0101,B,3.000,Introduction to Management,"[{'days': 'T', 'times': '0500pm-0730pm', 'date...",['T 0500pm-0730pm 09/01-12/07 BNW 131'],J Michael Cavanaugh,30,25,5

In [23]:
df_course.describe()

                crn           cap           act           rem
count  15937.000000  15937.000000  15937.000000  15937.000000
mean   55172.299178     17.992784     15.578591      2.477317
std    19308.879968     12.671906     10.107690     12.709781
min    10893.000000      0.000000     -1.000000    -75.000000
25%    35426.000000     10.000000      7.000000      0.000000
50%    57145.000000     19.000000     15.000000      1.000000
75%    74541.000000     25.000000     23.000000      5.000000
max    79215.000000    500.000000     90.000000    999.000000

In [24]:
df_course.to_sql('import_course', conn, if_exists='append', index=0)

In [25]:
%%sql
SELECT *
FROM import_course
LIMIT 10;

 * sqlite:///CourseData2.db
Done.

[('Fall2014', 70384, 'AC 0011', 'C01', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31),
 ('Fall2014', 70385, 'AC 0011', 'C02', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0930am-1045am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31),
 ('Fall2014', 70382, 'AC 0011', 'C03', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 1230pm-0145pm 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31),
 ('Fall2014', 70291, 'AC 0011', 'C04', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1100am-1215pm 09/02-12/08 DSB 111']", 'Rebecca I.  Bloch', 0, 29, -29),
 ('Fall2014', 70350, 'AC 0011', 'C05', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1230pm-0145pm 09/02-12/08 DSB 111']", 'Rebecca I.  Bloch', 0, 30, -30),
 ('Fall2014', 70381, 'AC 0011', 'C06', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '0330pm-0445pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['MR 0330pm-0445pm 09/02-12/08 DSB 110A']", 'Rebecca I.  Bloch', 0, 31, -31),
 ('Fall2014', 70383, 'AC 0011', 'G', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 0930am-1045am 09/02-12/08 DSB 111']", 'Paul   Caster', 30, 31, -1),
 ('Fall2014', 70391, 'AC 0011', 'H', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['TF 0930am-1045am 09/02-12/08 DSB 110A']", 'Jo Ann   Drusbosky', 30, 32, -2),
 ('Fall2014', 71105, 'AC 0011', 'I', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['TF 1100am-1215pm 09/02-12/08 DSB 110A']", 'Jo Ann   Drusbosky', 30, 33, -3),
 ('Fall2014', 71123, 'AC 0011', 'J', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0200pm-0315pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0200pm-0315pm 09/02-12/08 DSB 105']", 'Jo Ann   Drusbosky', 30, 32, -2)]

**Creating dataframes for the import course_meeting**

In [26]:
cm_fall = ['SourceData/Fall2014/course_meetings.csv', 'SourceData/Fall2015/course_meetings.csv',
           'SourceData/Fall2016/course_meetings.csv', 'SourceData/Fall2017/course_meetings.csv',
          'SourceData/Fall2018/course_meetings.csv']
dfcmf1 = pd.read_csv(cm_fall[0])
dfcmf2  = pd.read_csv(cm_fall[1])
dfcmf3  = pd.read_csv(cm_fall[2])
dfcmf4  = pd.read_csv(cm_fall[3])
dfcmf5  = pd.read_csv(cm_fall[4])

In [27]:
df_cmfall = pd.concat([dfcmf1, dfcmf2, dfcmf3, dfcmf4, dfcmf5], axis=0)
df_cmfall.sample(5)

           term    crn location day                start                  end
15466  Fall2017  71309  CNS 104   T  2017-11-28T11:00:00  2017-11-28T11:50:00
13861  Fall2017  71047    CNS 1   M  2017-10-02T12:00:00  2017-10-02T12:50:00
12305  Fall2016  77318    CNS 6   R  2016-09-08T09:30:00  2016-09-08T10:20:00
4493   Fall2015  75596  BNW 362   R  2015-11-12T17:00:00  2015-11-12T20:50:00
2275   Fall2014  72230  SON 203   R  2014-10-23T11:00:00  2014-10-23T12:15:00

In [28]:
cm_spring = ['SourceData/Spring2015/course_meetings.csv',
           'SourceData/Spring2016/course_meetings.csv', 'SourceData/Spring2017/course_meetings.csv',
          'SourceData/Spring2018/course_meetings.csv', 'SourceData/Spring2019/course_meetings.csv']
dfcms1 = pd.read_csv(cm_spring[0])
dfcms2  = pd.read_csv(cm_spring[1])
dfcms3  = pd.read_csv(cm_spring[2])
dfcms4  = pd.read_csv(cm_spring[3])
dfcms5  = pd.read_csv(cm_spring[4])

In [29]:
df_cmspring = pd.concat([dfcms1, dfcms2, dfcms3, dfcms4, dfcms5], axis=0)
df_cmspring.sample(5)

,term,crn,location,day,start,end
1709,Spring2016,37314,DMH 149,T,2016-02-16T15:30:00,2016-02-16T16:20:00
25288,Spring2019,37255,CNS 5,M,2019-01-28T10:00:00,2019-01-28T10:50:00
8828,Spring2016,37126,CNS 305,F,2016-02-12T14:00:00,2016-02-12T15:15:00
8349,Spring2015,31914,CNS 208,T,2015-02-17T14:00:00,2015-02-17T15:15:00
23846,Spring2015,34032,BNW 469,W,2015-04-01T14:00:00,2015-04-01T16:30:00

In [30]:
cm_springbreak = ['SourceData/SpringBreak2017/course_meetings.csv']

dfcmsb1 = pd.read_csv(cm_springbreak[0])

In [31]:
cm_summer = ['SourceData/Summer2015/course_meetings.csv',
           'SourceData/Summer2016/course_meetings.csv', 'SourceData/Summer2017/course_meetings.csv',
          'SourceData/Summer2018/course_meetings.csv']
dfcmsu1 = pd.read_csv(cm_summer[0])
dfcmsu2  = pd.read_csv(cm_summer[1])
dfcmsu3  = pd.read_csv(cm_summer[2])
dfcmsu4  = pd.read_csv(cm_summer[3])

In [32]:
df_cmsummer = pd.concat([dfcmsu1, dfcmsu2, dfcmsu3, dfcmsu4], axis=0)
df_cmspring.sample(5)

,term,crn,location,day,start,end
29578,Spring2016,37146,LYL 22,R,2016-02-04T09:30:00,2016-02-04T12:00:00
18811,Spring2017,32259,BNW 256,R,2017-04-20T10:00:00,2017-04-20T10:50:00
17216,Spring2017,32917,BNW GR22,W,2017-04-05T13:00:00,2017-04-05T13:50:00
16174,Spring2019,37458,NHS 403,W,2019-04-10T12:00:00,2019-04-10T12:50:00
20426,Spring2018,35400,NHS 104,T,2018-02-06T11:00:00,2018-02-06T12:15:00

In [33]:
cm_winter = ['SourceData/Winter2015/course_meetings.csv',
           'SourceData/Winter2016/course_meetings.csv', 'SourceData/Winter2017/course_meetings.csv',
          'SourceData/Winter2018/course_meetings.csv']
dfcmw1 = pd.read_csv(cm_winter[0])
dfcmw2  = pd.read_csv(cm_winter[1])
dfcmw3  = pd.read_csv(cm_winter[2])
dfcmw4  = pd.read_csv(cm_winter[3])

In [34]:
df_cmwinter = pd.concat([dfcmw1, dfcmw2, dfcmw3, dfcmw4], axis=0)
df_cmwinter.sample(5)

          term    crn location day                start                  end
98  Winter2016  11619  DSB 104   W  2016-01-13T09:00:00  2016-01-13T12:00:00
98  Winter2015  10905    LYL 8   W  2015-01-07T08:30:00  2015-01-07T16:30:00
93  Winter2017  11720   CNS 15   W  2017-01-11T09:00:00  2017-01-11T15:00:00
50  Winter2015  10909  DSB 111   M  2015-01-05T18:00:00  2015-01-05T21:30:00
73  Winter2017  11720  CNS 202   T  2017-01-03T09:00:00  2017-01-03T15:00:00

In [35]:
df_coursemeeting = pd.concat([df_cmfall,df_cmspring,dfcmsb1,df_cmspring,df_cmwinter],axis=0)
df_coursemeeting.sample(5)

,term,crn,location,day,start,end
5773,Spring2016,38808,DMH 350,M,2016-05-02T11:00:00,2016-05-02T12:15:00
7771,Spring2019,37986,BNW 138,W,2019-04-17T18:30:00,2019-04-17T21:00:00
14904,Fall2017,72887,DLH 107,T,2017-10-03T09:30:00,2017-10-03T12:00:00
27806,Fall2014,71994,DMH 349,R,2014-10-23T09:30:00,2014-10-23T10:20:00
23102,Spring2019,37623,CNS 303,M,2019-01-28T11:00:00,2019-01-28T11:50:00

In [36]:
df_coursemeeting.to_sql('import_course_meeting', conn, if_exists='append', index=0)

In [37]:
%%sql
SELECT *
FROM import_course_meeting
LIMIT 10;

 * sqlite:///CourseData2.db
Done.

[('Fall2014', 70384, 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 ('Fall2014', 70384, 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 ('Fall2014', 70384, 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 ('Fall2014', 70384, 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 ('Fall2014', 70384, 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00'),
 ('Fall2014', 70384, 'DSB 105', 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00'),
 ('Fall2014', 70384, 'DSB 105', 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00'),
 ('Fall2014', 70384, 'DSB 105', 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00'),
 ('Fall2014', 70384, 'DSB 105', 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00'),
 ('Fall2014', 70384, 'DSB 105', 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00')]

**Creating the dataframes for import_course_catalog**

In [ ]:
cc2017_2018 = ['SourceData/CourseCatalog2017_2018/CourseCatalog2017_2018.csv']

dfcc17_18 = pd.read_csv(cc2017_2018[0])

In [ ]:
cc2018_2019 = ['SourceData/CourseCatalog2018_2019/CourseCatalog2018_2019.csv']

dfcc18_17 = pd.read_csv(cc2018_2019[0])

In [ ]:
meeting_test = ['SourceData/Fall2014/course_meetings.csv']
df_test = pd.read_csv(meeting_test[0])

In [ ]:
df_test.head()